DataProcessors/Renault_ЗаказыПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_ЗаказыПоставщику</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодВыборки</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SAPPR_ВидЗаказаПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказатьТолькоНевыгруженныеЗаказы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаЗаказов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выгружен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗаказа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыгрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/SAPPR_Заказано.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>SAPPR_Заказано</Name>
			<Comment>Данные для экспорта</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>TEXT_LINE</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SERIAL_NO</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>REQ_DATE</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SHIP_PART</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>REQ_QTY</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>DOC_TYPE</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SAPPR_ВидЗаказаПоставщику</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>PURCH_NO_C</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ITM_NUMBER</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отправлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>MATERIAL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>В регистре хранятся значения дополнительных свойств объектов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение свойства</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект (справочник или документ) для которого существуют и могут быть назначены дополнительные свойства</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НазначенияСвойствОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>Вид свойства</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/SAPPR_ВидЗаказаПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>SAPPR_ВидЗаказаПоставщику</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ZMP1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ZMP2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ZMP4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ZMP8</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ZMP9</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/Renault_ЗаказыПоставщику/Ext/ObjectModule.bsl
////@+ Процедура ЗаполнитьТаблицы()
// Дата создания - 27.11.2014 
// Автор - Синявский Филипп
// 
// Описание процедуры
//  Процедура производит выборку информации из регистров 
//  и заполняет табличные части АРМа
//
// Параметры
//  Без параметров
//@-
Процедура ЗаполнитьТаблицы() Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	 |	SAPPR_Заказано.ЗаказПоставщику.Ссылка КАК Заказ,
	 |	SAPPR_Заказано.ЗаказПоставщику.СуммаДокумента КАК СуммаДокумента,
	 |	SAPPR_Заказано.Отправлен КАК Выгружен,
	 //|	SAPPR_Заказано.ДатаВыгрузки КАК ДатаВыгрузки,
	 |	SAPPR_Заказано.ЗаказПоставщику.Дата КАК ДатаЗаказа
	 |ИЗ
	 |	РегистрСведений.SAPPR_Заказано КАК SAPPR_Заказано
	 |ГДЕ
	 | SAPPR_Заказано.ЗаказПоставщику.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	 |	И SAPPR_Заказано.ЗаказПоставщику.Проведен = ИСТИНА
	 |	И SAPPR_Заказано.ЗаказПоставщику.Организация В(&Организация)
	 |");
	 
	 Если ПоказатьТолькоНевыгруженныеЗаказы = Истина Тогда
	Запрос.Текст = Запрос.Текст +"И SAPPR_Заказано.Отправлен = ЛОЖЬ"	 
	 КонецЕсли;
	//"ВЫБРАТЬ
	//|	ЗаказПоставщику.Ссылка КАК Заказ,
	//|	ЗаказПоставщику.Дата КАК ДатаЗаказа,
	//|	ЛОЖЬ КАК Выгружен,
	//|	Renault_ВыгруженныеЗаказыПоставщику.ДатаВыгрузки КАК ДатаВыгрузки,
	//|	ЗаказПоставщику.СуммаДокумента КАК СуммаДокумента
	//|ИЗ
	//|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ВыгруженныеЗаказыПоставщику КАК Renault_ВыгруженныеЗаказыПоставщику
	//|		ПО (Renault_ВыгруженныеЗаказыПоставщику.Заказ = ЗаказПоставщику.Ссылка)
	//|ГДЕ
	//|	ЗаказПоставщику.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	//|	И ЗаказПоставщику.Проведен = ИСТИНА
	//|	И ЗаказПоставщику.Организация В(&Организация)"
	//);
	
	 	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("ДатаНачала", ПериодВыборки.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",ПериодВыборки.ДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	ТаблицаЗаказов.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		НС = ТаблицаЗаказов.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Выборка);
		//Если НЕ Выборка.ДатаВыгрузки = Дата("00010101")  Тогда
		//	НС.Выгружен = Истина;
		//КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
Функция ПолучитьНомерSAPPR() Экспорт
	НомерФайла	= Renault_ОбщийМодуль.ПолучитьЗначениеСвойства(Организация,"НомерФайлаSAPPR");
	Возврат НомерФайла;
КонецФункции


///////////////////////////////////////
// Modify Окипний А.Е.
Процедура ВыгрузитьДанныеSAPPR() Экспорт
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Renault_Открытый.СообщитьПользователю("Не указана организация");
		Возврат;
	КонецЕсли;
	
	/////////////////////////////////////////////////////
	//		Added Окипний А.Е.
	НомерФайлаSAPPR = ПолучитьНомерSAPPR();
	
	/////////////////////////////////////////////////////
	//		Added Окипний А.Е.
	BIR3M = Renault_ОбщийМодуль.ПолучитьИдентификатор(Организация);
	
	/////////////////////////////////////////////////////
	//		Added Окипний А.Е.
	Если НЕ ЗначениеЗаполнено(BIR3M) тогда
		Renault_Открытый.СообщитьПользователю("У организации не указан код дилера");
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(НомерФайлаSAPPR) Тогда
		НомерФайлаSAPPR = 1;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПутьВыгрузки) Тогда
		Renault_Открытый.СообщитьПользователюь("Укажите путь выгрузки данных!");
		Возврат;
	КонецЕсли;
	
	BIR3M = СокрЛП(BIR3M);
		
	ВремТаблицаЗнач=Новый ТаблицаЗначений;    
	ВремТаблицаЗнач.Колонки.Добавить("ЗаказПоставщику");
	Для каждого СтрокиТабЗаказов из ТаблицаЗаказов Цикл
		Если СтрокиТабЗаказов.Пометка = Истина Тогда
			Стр=ВремТаблицаЗнач.Добавить();
			Стр.ЗаказПоставщику = СтрокиТабЗаказов.Заказ;
			Срок = НачалоДня(ТекущаяДата())+86400;
			Если СтрокиТабЗаказов.Заказ.СрокПоставки < Срок Тогда
			 Renault_Открытый.СообщитьПользователю("У заказа "+СтрокиТабЗаказов.Заказ+" срок поставки "+СтрокиТабЗаказов.Заказ.СрокПоставки+" раньше чем "+Срок);

			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	SAPPR.PURCH_NO_C КАК PURCH_NO_C,
	|	SAPPR.ITM_NUMBER КАК ITM_NUMBER,
	|	SAPPR.DOC_TYPE КАК DOC_TYPE,
	|	SAPPR.MATERIAL КАК MATERIAL,
	|	SAPPR.REQ_QTY КАК REQ_QTY,
	|	SAPPR.SHIP_PART КАК SHIP_PART,
	|	SAPPR.TEXT_LINE КАК TEXT_LINE,
	|	SAPPR.SERIAL_NO КАК SERIAL_NO,
	|	SAPPR.REQ_DATE КАК REQ_DATE,
	|	SAPPR.ЗаказПоставщику
	|ИЗ
	|	РегистрСведений.SAPPR_Заказано КАК SAPPR
	|ГДЕ
	|  SAPPR.ЗаказПоставщику.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
//	|	И SAPPR.Отправлен = ЛОЖЬ
	|	И SAPPR.Организация = &Организация
	|	И SAPPR.REQ_DATE >= &REQ_DATE
	|   И SAPPR.ЗаказПоставщику В (&ВремТаблицаЗнач)
	|ИТОГИ
	|	МАКСИМУМ(ITM_NUMBER),
	|	МАКСИМУМ(MATERIAL),
	|	МАКСИМУМ(REQ_QTY),
	|	МАКСИМУМ(SHIP_PART),
	|	МАКСИМУМ(TEXT_LINE),
	|	МАКСИМУМ(SERIAL_NO),
	|	МАКСИМУМ(REQ_DATE)
	|ПО
	|	DOC_TYPE,
	|	PURCH_NO_C";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("REQ_DATE", НачалоДня(ТекущаяДата())+86400);
	Запрос.УстановитьПараметр("ДатаНачала", ПериодВыборки.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",ПериодВыборки.ДатаОкончания);
	Запрос.УстановитьПараметр("ВремТаблицаЗнач",ВремТаблицаЗнач);
	
	Результат = Запрос.Выполнить();
	РезультатЗапроса = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если РезультатЗапроса.Строки.Количество()=0 Тогда
		Renault_Открытый.СообщитьПользователю("Нет данных для выгрузки!");
		Возврат;
	КонецЕсли;
	
	
	ТекстДок = Новый ТекстовыйДокумент();
	КраткоеИмя = СтрЗаменить(""+BIR3M + ".BIR.CCD."+ BIR3M + "." + Формат(НомерФайлаSAPPR,"ЧЦ=4; ЧВН=; ЧГ=0"), " ", "");
	ИмяФайла = ?(Прав(ПутьВыгрузки,1) = "\", ПутьВыгрузки, ПутьВыгрузки+"\") + КраткоеИмя;
	
	Для Каждого НомСтр Из РезультатЗапроса.Строки Цикл
		
		Разделитель = ПолучитьСтрокуПозиции("*S*"+BIR3M+"*S*", 112);
		
		ТекстДок.ДобавитьСтроку(Разделитель);
		
		Для Каждого Заказ из НомСтр.Строки Цикл
			Для Каждого СтрокаЗаказа из Заказ.Строки Цикл
				SOLD_PART 	= BIR3M;
				MaxStr		= 10;
				Позиция1	= ПолучитьСтрокуПозиции(SOLD_PART,MaxStr);
				
				PURCH_NO_C 	= СтрокаЗаказа.PURCH_NO_C;
				MaxStr		= 10;
				Позиция2	= ПолучитьСтрокуПозиции(PURCH_NO_C,MaxStr);
				
				//Numbered on a 10 basis  or 100 basis:  
				//If item number receive = 10 20 30 the 
				//items number into the sale order will be : 100, 200, 300, ….
				//If the item number receive = 1,2, 3
				//The items number into the sale order will be 10 20 30…

				ITM_NUMBER  = Формат(СтрокаЗаказа.ITM_NUMBER * 100,"ЧЦ=6; ЧВН=; ЧГ=0"); 
				MaxStr		= 6;
				Позиция3	= ПолучитьСтрокуПозиции(ITM_NUMBER,MaxStr);
				
				Если ТипЗаказа = Перечисления.SAPPR_ВидЗаказаПоставщику.ZMP1 тогда
					DOC_TYPE  	= "ZMP1";
				ИначеЕсли ТипЗаказа = Перечисления.SAPPR_ВидЗаказаПоставщику.ZMP2 тогда
					DOC_TYPE  	= "ZMP2";
				ИначеЕсли ТипЗаказа = Перечисления.SAPPR_ВидЗаказаПоставщику.ZMP4 тогда
					DOC_TYPE  	= "ZMP4";
				КонецЕсли;
				MaxStr		= 4;
				Позиция4	= ПолучитьСтрокуПозиции(DOC_TYPE,MaxStr);
				
				MATERIAL  	= СтрокаЗаказа.MATERIAL;
				MaxStr		= 18;
				Позиция5	= ПолучитьСтрокуПозиции(MATERIAL,MaxStr);
				
				REQ_QTY  	= Формат(СтрокаЗаказа.REQ_QTY,"ЧГ=0");
				MaxStr		= 6;
				Позиция6	= ПолучитьСтрокуПозиции(REQ_QTY,MaxStr);
				
				SHIP_PART  	= Формат(СкладПолучатель,"ЧГ=0");
				MaxStr		= 10;
				Позиция7	= ПолучитьСтрокуПозиции(SHIP_PART,MaxStr);
				
				TEXT_LINE  	= СтрокаЗаказа.TEXT_LINE;
				MaxStr		= 20;
				Позиция8	= ПолучитьСтрокуПозиции(TEXT_LINE,MaxStr);
				
				SERIAL_NO  	= СтрокаЗаказа.SERIAL_NO;
				MaxStr		= 20;
				Позиция9	= ПолучитьСтрокуПозиции(SERIAL_NO,MaxStr);
				
				REQ_DATE  	= Формат(СтрокаЗаказа.REQ_DATE,"ДФ=ггггММдд");
				MaxStr		= 8;
				Позиция10	= ПолучитьСтрокуПозиции(REQ_DATE,MaxStr);

				СтрокаТхт = Позиция1+Позиция2+Позиция3+Позиция4+Позиция5+Позиция6+Позиция7+Позиция8+Позиция9+Позиция10;
				ТекстДок.ДобавитьСтроку(СтрокаТхт);
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	
	/////////////////////////////////////////////////////
	//		Modify Окипний А.Е.
	Если НЕ ТекстДок.КоличествоСтрок() = 0 тогда //Защита от формирования пустых файлов
		Попытка
			ТекстДок.Записать(ИмяФайла,"iso-8859-5");
		Исключение
			Renault_Открытый.СообщитьПользователю("Не удалось записать файл"+ Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Важное);	
		КонецПопытки;
		
		//Запишем новый номер в свойство Организация
		СвойствоВидИспользования = ПланыВидовХарактеристик.СвойстваОбъектов.НомерФайлаSAPPR;
		
		НаборЗаписейЗначенияСвойствОбъектов								= РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
		НаборЗаписейЗначенияСвойствОбъектов.Отбор.Объект.Значение 		= Организация;
		НаборЗаписейЗначенияСвойствОбъектов.Отбор.Объект.Использование 	= Истина;
		НаборЗаписейЗначенияСвойствОбъектов.Отбор.Свойство.Значение 	= СвойствоВидИспользования;
		НаборЗаписейЗначенияСвойствОбъектов.Отбор.Свойство.Использование= Истина;
		НаборЗаписейЗначенияСвойствОбъектов.Прочитать();
		НаборЗаписейЗначенияСвойствОбъектов.Очистить();
		
		НоваяЗапись 		 = НаборЗаписейЗначенияСвойствОбъектов.Добавить();
		НоваяЗапись.Объект 	 = Организация;
		НоваяЗапись.Свойство = СвойствоВидИспользования;
		НоваяЗапись.Значение = НомерФайлаSAPPR + 1;
			
		Попытка
			НаборЗаписейЗначенияСвойствОбъектов.Записать();	
		Исключение
			Renault_Открытый.СообщитьПользователю("Не удалось записать значение свойства  " + Строка(СвойствоВидИспользования) + " для " + Организация.Наименование, СтатусСообщения.Важное);	
		КонецПопытки;
		
		НомерФайлаSAPPR = ПолучитьНомерSAPPR();
		
		//Отметим в регистре SAPPR флаг отправки
		ТабЗаказов = Результат.Выгрузить();
		ТабЗаказов.Свернуть("ЗаказПоставщику");
		
		Для каждого СтрокаЗаказ из ТабЗаказов Цикл
			Набор = РегистрыСведений.SAPPR_Заказано.СоздатьНаборЗаписей();
			
			Набор.Отбор.ЗаказПоставщику.Установить(СтрокаЗаказ.ЗаказПоставщику);
			Набор.Прочитать();
			
			ВремТЗ = Набор.Выгрузить();
			ВремТЗ.ЗаполнитьЗначения(Истина, "Отправлен");
			ВремТЗ.ЗаполнитьЗначения(ТекущаяДата(),"ДатаВыгрузки");
			ВремТЗ.ЗаполнитьЗначения(СкладПолучатель,"SHIP_PART");
			ВремТЗ.ЗаполнитьЗначения(ТипЗаказа,"DOC_TYPE");
			
			Набор.Загрузить(ВремТЗ);
			
			//Попытка записать, хотя ошибок быть не должно.
			Попытка
				Набор.Записать();
			Исключение
				Renault_Открытый.СообщитьПользователю("Не удалось внести изменения в таблицу заказов SAPPR.", СтатусСообщения.Важное);
			КонецПопытки;
			
		КонецЦикла;
	КонецЕсли;
ЗаполнитьТаблицы();	
КонецПроцедуры

Функция ПолучитьСтрокуПозиции(Поле,MaxStr)
	
	ДлинаПоля 	= СтрДлина(Поле);
	КолПробелов = MaxStr-ДлинаПоля;
	
	Для Ном = 1 По КолПробелов Цикл
		Поле = Поле + " ";
	КонецЦикла;
	
    Возврат Поле;
КонецФункции
